#include <stdio.h>

void main()
{
    long N = 0;       // зм?нна для збер?гання номера елемента
    long S = 0;       // зм?нна для збер?гання суми
    long P = 1;       // зм?нна для збер?гання поточного елемента прогрес?ї

    __asm {
    m1:
        inc N       // зб?льшуємо номер елемента прогрес?ї
            mov EAX, N  // EAX = N
            mul P       // множимо елемент прогрес?ї на N
            add S, EAX  // додаємо елемент до суми
            cmp S, 20000 // пор?внюємо суму з 20000
            jl m1       // перех?д, якщо сума ще менше 20000
    }

    // Виводимо результат
    printf("Номер елемента, при якому сума перевищить 20000: %ld\n", N);
}
